mentatpsi/Microchip/PIC24F Starter Kit 1/p24FJ256GB106.h
/* PMD6 */
#define _SPI3MD PMD6bits.SPI3MD


/* ---------------------------------------------------------- */
/* Some useful macros for inline assembly stuff               */
/* ---------------------------------------------------------- */

#define Nop()    {__asm__ volatile ("nop");}
#define ClrWdt() {__asm__ volatile ("clrwdt");}
#define Sleep()  {__asm__ volatile ("pwrsav #0");}
#define Idle()   {__asm__ volatile ("pwrsav #1");}

/*----------------------------------------------------------- */
/* Some useful macros for allocating data memory              */
/*----------------------------------------------------------- */

/* The following macros require an argument N that specifies  */
/* alignment. N must a power of two, minimum value = 2.       */
/* For example, to declare an uninitialized array that is     */
/* aligned to a 32 byte address:                              */
/*                                                            */
/* int _BSS(32) buf[16];                                      */
/*                                                            */
/* To declare an initialized array without special            */
/* alignment:                                                 */
/*                                                            */
/* int _DATA(2) table1[] = {0, 1, 1, 2, 3, 5, 8, 13, 21};     */
/*                                                            */
#define _BSS(N)    __attribute__((aligned(N)))
#define _DATA(N)   __attribute__((aligned(N)))

/* The following macros do not require an argument. They can  */
/* be used to locate a variable in persistent data memory or  */
/* in near data memory. For example, to declare two variables */
/* that retain their values across a device reset:            */
/*                                                            */
/* int _PERSISTENT var1,var2;                                 */
/*                                                            */
#define _PERSISTENT __attribute__((persistent))
#define _NEAR       __attribute__((near))

/* ---------------------------------------------------------- */
/* Some useful macros for declaring functions                 */
/* ---------------------------------------------------------- */

/* The following macros can be used to declare interrupt      */
/* service routines (ISRs). For example, to declare an ISR    */
/* for the timer1 interrupt:                                  */
/*                                                            */
/* void _ISR _T1Interrupt(void);                              */
/*                                                            */
/* To declare an ISR for the SPI1 interrupt with fast         */
/* context save:                                              */
/*                                                            */
/* void _ISRFAST _SPI1Interrupt(void);                        */
/*                                                            */
/* Note: ISRs will be installed into the interrupt vector     */
/* tables automatically if the reserved names listed in the   */
/* MPLAB C30 Compiler User's Guide (DS51284) are used.        */
/*                                                            */
#define _ISR __attribute__((interrupt))
#define _ISRFAST __attribute__((interrupt, shadow))

/* ---------------------------------------------------------- */
/* Some useful macros for changing the CPU IPL                */
/* ---------------------------------------------------------- */

/* The following macros can be used to modify the current CPU */
/* IPL. The definition of the macro may vary from device to   */
/* device.                                                    */
/*                                                            */
/* To safely set the CPU IPL, use SET_CPU_IPL(ipl); the       */
/* valid range of ipl is 0-7, it may be any expression.       */
/*                                                            */
/* SET_CPU_IPL(7);                                            */
/*                                                            */
/* To preserve the current IPL and save it use                */
/* SET_AND_SAVE_CPU_IPL(save_to, ipl); the valid range of ipl */
/* is 0-7 and may be any expression, save_to should denote    */
/* some temporary storage.                                    */
/*                                                            */
/* int old_ipl;                                               */
/*                                                            */
/* SET_AND_SAVE_CPU_IPL(old_ipl, 7);                          */
/*                                                            */
/* The IPL can be restored with RESTORE_CPU_IPL(saved_to)     */
/*                                                            */
/* RESTORE_CPU_IPL(old_ipl);                                  */

#define SET_CPU_IPL(ipl) {       \
  int DISI_save;                 \
                                 \
  DISI_save = DISICNT;           \
  asm volatile ("disi #0x3FFF"); \
  SRbits.IPL = ipl;              \
  DISICNT = DISI_save; } (void) 0;

#define SET_AND_SAVE_CPU_IPL(save_to, ipl) { \
  save_to = SRbits.IPL; \
  SET_CPU_IPL(ipl); } (void) 0;

#define RESTORE_CPU_IPL(saved_to) SET_CPU_IPL(saved_to)



/* -------------------------------------------------------- */
/* Macros for setting device configuration registers        */
/* -------------------------------------------------------- */

/* Register CONFIG3 (0x2abfa)                               */

#define _CONFIG3(x) __attribute__((section("__CONFIG3.sec,code"))) int _CONFIG3 = (x);

/*
** Only one invocation of CONFIG3 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set CONFIG3.
** Multiple options may be combined, as shown:
**
** _CONFIG3( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Write Protection Location:
**     WPEND_WPSTARTMEM     Write Protect from page 0 to WPFP
**     WPEND_WPENDMEM       Write Protect from WPFP to the last page of memory
**
**   Write Protect Configuration Page:
**     WPCFG_WPCFGEN        Enabled
**     WPCFG_WPCFGDIS       Disabled
**
**   Write Protection Disable:
**     WPDIS_WPEN           Enabled
**     WPDIS_WPDIS          Disabled
**
**   Write Protection Flash Page:
**     WPFP_WPFP0           0
**     WPFP_WPFP1           1
**     WPFP_WPFP2           2
**     WPFP_WPFP3           3
**     WPFP_WPFP4           4
**     WPFP_WPFP5           5
**     WPFP_WPFP6           6
**     WPFP_WPFP7           7
**     WPFP_WPFP8           8
**     WPFP_WPFP9           9
**     WPFP_WPFP10          10
**     WPFP_WPFP11          11
**     WPFP_WPFP12          12
**     WPFP_WPFP13          13
**     WPFP_WPFP14          14
**     WPFP_WPFP15          15
**     WPFP_WPFP16          16
**     WPFP_WPFP17          17
**     WPFP_WPFP18          18
**     WPFP_WPFP19          19
**     WPFP_WPFP20          20
**     WPFP_WPFP21          21
**     WPFP_WPFP22          22
**     WPFP_WPFP23          23
**     WPFP_WPFP24          24
**     WPFP_WPFP25          25
**     WPFP_WPFP26          26
**     WPFP_WPFP27          27
**     WPFP_WPFP28          28
**     WPFP_WPFP29          29
**     WPFP_WPFP30          30
**     WPFP_WPFP31          31
**     WPFP_WPFP32          32
**     WPFP_WPFP33          33
**     WPFP_WPFP34          34
**     WPFP_WPFP35          35
**     WPFP_WPFP36          36
**     WPFP_WPFP37          37
**     WPFP_WPFP38          38
**     WPFP_WPFP39          39
**     WPFP_WPFP40          40
**     WPFP_WPFP41          41
**     WPFP_WPFP42          42
**     WPFP_WPFP43          43
**     WPFP_WPFP44          44
**     WPFP_WPFP45          45
**     WPFP_WPFP46          46
**     WPFP_WPFP47          47
**     WPFP_WPFP48          48
**     WPFP_WPFP49          49
**     WPFP_WPFP50          50
**     WPFP_WPFP51          51
**     WPFP_WPFP52          52
**     WPFP_WPFP53          53
**     WPFP_WPFP54          54
**     WPFP_WPFP55          55
**     WPFP_WPFP56          56
**     WPFP_WPFP57          57
**     WPFP_WPFP58          58
**     WPFP_WPFP59          59
**     WPFP_WPFP60          60
**     WPFP_WPFP61          61
**     WPFP_WPFP62          62
**     WPFP_WPFP63          63
**     WPFP_WPFP64          64
**     WPFP_WPFP65          65
**     WPFP_WPFP66          66
**     WPFP_WPFP67          67
**     WPFP_WPFP68          68
**     WPFP_WPFP69          69
**     WPFP_WPFP70          70
**     WPFP_WPFP71          71
**     WPFP_WPFP72          72
**     WPFP_WPFP73          73
**     WPFP_WPFP74          74
**     WPFP_WPFP75          75
**     WPFP_WPFP76          76
**     WPFP_WPFP77          77
**     WPFP_WPFP78          78
**     WPFP_WPFP79          79
**     WPFP_WPFP80          80
**     WPFP_WPFP81          81
**     WPFP_WPFP82          82
**     WPFP_WPFP83          83
**     WPFP_WPFP84          84
**     WPFP_WPFP85          85
**     WPFP_WPFP86          86
**     WPFP_WPFP87          87
**     WPFP_WPFP88          88
**     WPFP_WPFP89          89
**     WPFP_WPFP90          90
**     WPFP_WPFP91          91
**     WPFP_WPFP92          92
**     WPFP_WPFP93          93
**     WPFP_WPFP94          94
**     WPFP_WPFP95          95
**     WPFP_WPFP96          96
**     WPFP_WPFP97          97
**     WPFP_WPFP98          98
**     WPFP_WPFP99          99
**     WPFP_WPFP100         100
**     WPFP_WPFP101         101
**     WPFP_WPFP102         102
**     WPFP_WPFP103         103
**     WPFP_WPFP104         104
**     WPFP_WPFP105         105
**     WPFP_WPFP106         106
**     WPFP_WPFP107         107
**     WPFP_WPFP108         108
**     WPFP_WPFP109         109
**     WPFP_WPFP110         110
**     WPFP_WPFP111         111
**     WPFP_WPFP112         112
**     WPFP_WPFP113         113
**     WPFP_WPFP114         114
**     WPFP_WPFP115         115
**     WPFP_WPFP116         116
**     WPFP_WPFP117         117
**     WPFP_WPFP118         118
**     WPFP_WPFP119         119
**     WPFP_WPFP120         120
**     WPFP_WPFP121         121
**     WPFP_WPFP122         122
**     WPFP_WPFP123         123
**     WPFP_WPFP124         124
**     WPFP_WPFP125         125
**     WPFP_WPFP126         126
**     WPFP_WPFP127         127
**     WPFP_WPFP128         128
**     WPFP_WPFP129         129
**     WPFP_WPFP130         130
**     WPFP_WPFP131         131
**     WPFP_WPFP132         132
**     WPFP_WPFP133         133
**     WPFP_WPFP134         134
**     WPFP_WPFP135         135
**     WPFP_WPFP136         136
**     WPFP_WPFP137         137
**     WPFP_WPFP138         138
**     WPFP_WPFP139         139
**     WPFP_WPFP140         140
**     WPFP_WPFP141         141
**     WPFP_WPFP142         142
**     WPFP_WPFP143         143
**     WPFP_WPFP144         144
**     WPFP_WPFP145         145
**     WPFP_WPFP146         146
**     WPFP_WPFP147         147
**     WPFP_WPFP148         148
**     WPFP_WPFP149         149
**     WPFP_WPFP150         150
**     WPFP_WPFP151         151
**     WPFP_WPFP152         152
**     WPFP_WPFP153         153
**     WPFP_WPFP154         154
**     WPFP_WPFP155         155
**     WPFP_WPFP156         156
**     WPFP_WPFP157         157
**     WPFP_WPFP158         158
**     WPFP_WPFP159         159
**     WPFP_WPFP160         160
**     WPFP_WPFP161         161
**     WPFP_WPFP162         162
**     WPFP_WPFP163         163
**     WPFP_WPFP164         164
**     WPFP_WPFP165         165
**     WPFP_WPFP166         166
**     WPFP_WPFP167         167
**     WPFP_WPFP168         168
**     WPFP_WPFP169         169
**     WPFP_WPFP170         170
**     WPFP_WPFP171         171
**     WPFP_WPFP172         172
**     WPFP_WPFP173         173
**     WPFP_WPFP174         174
**     WPFP_WPFP175         175
**     WPFP_WPFP176         176
**     WPFP_WPFP177         177
**     WPFP_WPFP178         178
**     WPFP_WPFP179         179
**     WPFP_WPFP180         180
**     WPFP_WPFP181         181
**     WPFP_WPFP182         182
**     WPFP_WPFP183         183
**     WPFP_WPFP184         184
**     WPFP_WPFP185         185
**     WPFP_WPFP186         186
**     WPFP_WPFP187         187
**     WPFP_WPFP188         188
**     WPFP_WPFP189         189
**     WPFP_WPFP190         190
**     WPFP_WPFP191         191
**     WPFP_WPFP192         192
**     WPFP_WPFP193         193
**     WPFP_WPFP194         194
**     WPFP_WPFP195         195
**     WPFP_WPFP196         196
**     WPFP_WPFP197         197
**     WPFP_WPFP198         198
**     WPFP_WPFP199         199
**     WPFP_WPFP200         200
**     WPFP_WPFP201         201
**     WPFP_WPFP202         202
**     WPFP_WPFP203         203
**     WPFP_WPFP204         204
**     WPFP_WPFP205         205
**     WPFP_WPFP206         206
**     WPFP_WPFP207         207
**     WPFP_WPFP208         208
**     WPFP_WPFP209         209
**     WPFP_WPFP210         210
**     WPFP_WPFP211         211
**     WPFP_WPFP212         212
**     WPFP_WPFP213         213
**     WPFP_WPFP214         214
**     WPFP_WPFP215         215
**     WPFP_WPFP216         216
**     WPFP_WPFP217         217
**     WPFP_WPFP218         218
**     WPFP_WPFP219         219
**     WPFP_WPFP220         220
**     WPFP_WPFP221         221
**     WPFP_WPFP222         222
**     WPFP_WPFP223         223
**     WPFP_WPFP224         224
**     WPFP_WPFP225         225
**     WPFP_WPFP226         226
**     WPFP_WPFP227         227
**     WPFP_WPFP228         228
**     WPFP_WPFP229         229
**     WPFP_WPFP230         230
**     WPFP_WPFP231         231
**     WPFP_WPFP232         232
**     WPFP_WPFP233         233
**     WPFP_WPFP234         234
**     WPFP_WPFP235         235
**     WPFP_WPFP236         236
**     WPFP_WPFP237         237
**     WPFP_WPFP238         238
**     WPFP_WPFP239         239
**     WPFP_WPFP240         240
**     WPFP_WPFP241         241
**     WPFP_WPFP242         242
**     WPFP_WPFP243         243
**     WPFP_WPFP244         244
**     WPFP_WPFP245         245
**     WPFP_WPFP246         246
**     WPFP_WPFP247         247
**     WPFP_WPFP248         248
**     WPFP_WPFP249         249
**     WPFP_WPFP250         250
**     WPFP_WPFP251         251
**     WPFP_WPFP252         252
**     WPFP_WPFP253         253
**     WPFP_WPFP254         254
**     WPFP_WPFP255         255
**     WPFP_WPFP256         256
**     WPFP_WPFP257         257
**     WPFP_WPFP258         258
**     WPFP_WPFP259         259
**     WPFP_WPFP260         260
**     WPFP_WPFP261         261
**     WPFP_WPFP262         262
**     WPFP_WPFP263         263
**     WPFP_WPFP264         264
**     WPFP_WPFP265         265
**     WPFP_WPFP266         266
**     WPFP_WPFP267         267
**     WPFP_WPFP268         268
**     WPFP_WPFP269         269
**     WPFP_WPFP270         270
**     WPFP_WPFP271         271
**     WPFP_WPFP272         272
**     WPFP_WPFP273         273
**     WPFP_WPFP274         274
**     WPFP_WPFP275         275
**     WPFP_WPFP276         276
**     WPFP_WPFP277         277
**     WPFP_WPFP278         278
**     WPFP_WPFP279         279
**     WPFP_WPFP280         280
**     WPFP_WPFP281         281
**     WPFP_WPFP282         282
**     WPFP_WPFP283         283
**     WPFP_WPFP284         284
**     WPFP_WPFP285         285
**     WPFP_WPFP286         286
**     WPFP_WPFP287         287
**     WPFP_WPFP288         288
**     WPFP_WPFP289         289
**     WPFP_WPFP290         290
**     WPFP_WPFP291         291
**     WPFP_WPFP292         292
**     WPFP_WPFP293         293
**     WPFP_WPFP294         294
**     WPFP_WPFP295         295
**     WPFP_WPFP296         296
**     WPFP_WPFP297         297
**     WPFP_WPFP298         298
**     WPFP_WPFP299         299
**     WPFP_WPFP300         300
**     WPFP_WPFP301         301
**     WPFP_WPFP302         302
**     WPFP_WPFP303         303
**     WPFP_WPFP304         304
**     WPFP_WPFP305         305
**     WPFP_WPFP306         306
**     WPFP_WPFP307         307
**     WPFP_WPFP308         308
**     WPFP_WPFP309         309
**     WPFP_WPFP310         310
**     WPFP_WPFP311         311
**     WPFP_WPFP312         312
**     WPFP_WPFP313         313
**     WPFP_WPFP314         314
**     WPFP_WPFP315         315
**     WPFP_WPFP316         316
**     WPFP_WPFP317         317
**     WPFP_WPFP318         318
**     WPFP_WPFP319         319
**     WPFP_WPFP320         320
**     WPFP_WPFP321         321
**     WPFP_WPFP322         322
**     WPFP_WPFP323         323
**     WPFP_WPFP324         324
**     WPFP_WPFP325         325
**     WPFP_WPFP326         326
**     WPFP_WPFP327         327
**     WPFP_WPFP328         328
**     WPFP_WPFP329         329
**     WPFP_WPFP330         330
**     WPFP_WPFP331         331
**     WPFP_WPFP332         332
**     WPFP_WPFP333         333
**     WPFP_WPFP334         334
**     WPFP_WPFP335         335
**     WPFP_WPFP336         336
**     WPFP_WPFP337         337
**     WPFP_WPFP338         338
**     WPFP_WPFP339         339
**     WPFP_WPFP340         340
**     WPFP_WPFP341         341
**     WPFP_WPFP342         342
**     WPFP_WPFP343         343
**     WPFP_WPFP344         344
**     WPFP_WPFP345         345
**     WPFP_WPFP346         346
**     WPFP_WPFP347         347
**     WPFP_WPFP348         348
**     WPFP_WPFP349         349
**     WPFP_WPFP350         350
**     WPFP_WPFP351         351
**     WPFP_WPFP352         352
**     WPFP_WPFP353         353
**     WPFP_WPFP354         354
**     WPFP_WPFP355         355
**     WPFP_WPFP356         356
**     WPFP_WPFP357         357
**     WPFP_WPFP358         358
**     WPFP_WPFP359         359
**     WPFP_WPFP360         360
**     WPFP_WPFP361         361
**     WPFP_WPFP362         362
**     WPFP_WPFP363         363
**     WPFP_WPFP364         364
**     WPFP_WPFP365         365
**     WPFP_WPFP366         366
**     WPFP_WPFP367         367
**     WPFP_WPFP368         368
**     WPFP_WPFP369         369
**     WPFP_WPFP370         370
**     WPFP_WPFP371         371
**     WPFP_WPFP372         372
**     WPFP_WPFP373         373
**     WPFP_WPFP374         374
**     WPFP_WPFP375         375
**     WPFP_WPFP376         376
**     WPFP_WPFP377         377
**     WPFP_WPFP378         378
**     WPFP_WPFP379         379
**     WPFP_WPFP380         380
**     WPFP_WPFP381         381
**     WPFP_WPFP382         382
**     WPFP_WPFP383         383
**     WPFP_WPFP384         384
**     WPFP_WPFP385         385
**     WPFP_WPFP386         386
**     WPFP_WPFP387         387
**     WPFP_WPFP388         388
**     WPFP_WPFP389         389
**     WPFP_WPFP390         390
**     WPFP_WPFP391         391
**     WPFP_WPFP392         392
**     WPFP_WPFP393         393
**     WPFP_WPFP394         394
**     WPFP_WPFP395         395
**     WPFP_WPFP396         396
**     WPFP_WPFP397         397
**     WPFP_WPFP398         398
**     WPFP_WPFP399         399
**     WPFP_WPFP400         400
**     WPFP_WPFP401         401
**     WPFP_WPFP402         402
**     WPFP_WPFP403         403
**     WPFP_WPFP404         404
**     WPFP_WPFP405         405
**     WPFP_WPFP406         406
**     WPFP_WPFP407         407
**     WPFP_WPFP408         408
**     WPFP_WPFP409         409
**     WPFP_WPFP410         410
**     WPFP_WPFP411         411
**     WPFP_WPFP412         412
**     WPFP_WPFP413         413
**     WPFP_WPFP414         414
**     WPFP_WPFP415         415
**     WPFP_WPFP416         416
**     WPFP_WPFP417         417
**     WPFP_WPFP418         418
**     WPFP_WPFP419         419
**     WPFP_WPFP420         420
**     WPFP_WPFP421         421
**     WPFP_WPFP422         422
**     WPFP_WPFP423         423
**     WPFP_WPFP424         424
**     WPFP_WPFP425         425
**     WPFP_WPFP426         426
**     WPFP_WPFP427         427
**     WPFP_WPFP428         428
**     WPFP_WPFP429         429
**     WPFP_WPFP430         430
**     WPFP_WPFP431         431
**     WPFP_WPFP432         432
**     WPFP_WPFP433         433
**     WPFP_WPFP434         434
**     WPFP_WPFP435         435
**     WPFP_WPFP436         436
**     WPFP_WPFP437         437
**     WPFP_WPFP438         438
**     WPFP_WPFP439         439
**     WPFP_WPFP440         440
**     WPFP_WPFP441         441
**     WPFP_WPFP442         442
**     WPFP_WPFP443         443
**     WPFP_WPFP444         444
**     WPFP_WPFP445         445
**     WPFP_WPFP446         446
**     WPFP_WPFP447         447
**     WPFP_WPFP448         448
**     WPFP_WPFP449         449
**     WPFP_WPFP450         450
**     WPFP_WPFP451         451
**     WPFP_WPFP452         452
**     WPFP_WPFP453         453
**     WPFP_WPFP454         454
**     WPFP_WPFP455         455
**     WPFP_WPFP456         456
**     WPFP_WPFP457         457
**     WPFP_WPFP458         458
**     WPFP_WPFP459         459
**     WPFP_WPFP460         460
**     WPFP_WPFP461         461
**     WPFP_WPFP462         462
**     WPFP_WPFP463         463
**     WPFP_WPFP464         464
**     WPFP_WPFP465         465
**     WPFP_WPFP466         466
**     WPFP_WPFP467         467
**     WPFP_WPFP468         468
**     WPFP_WPFP469         469
**     WPFP_WPFP470         470
**     WPFP_WPFP471         471
**     WPFP_WPFP472         472
**     WPFP_WPFP473         473
**     WPFP_WPFP474         474
**     WPFP_WPFP475         475
**     WPFP_WPFP476         476
**     WPFP_WPFP477         477
**     WPFP_WPFP478         478
**     WPFP_WPFP479         479
**     WPFP_WPFP480         480
**     WPFP_WPFP481         481
**     WPFP_WPFP482         482
**     WPFP_WPFP483         483
**     WPFP_WPFP484         484
**     WPFP_WPFP485         485
**     WPFP_WPFP486         486
**     WPFP_WPFP487         487
**     WPFP_WPFP488         488
**     WPFP_WPFP489         489
**     WPFP_WPFP490         490
**     WPFP_WPFP491         491
**     WPFP_WPFP492         492
**     WPFP_WPFP493         493
**     WPFP_WPFP494         494
**     WPFP_WPFP495         495
**     WPFP_WPFP496         496
**     WPFP_WPFP497         497
**     WPFP_WPFP498         498
**     WPFP_WPFP499         499
**     WPFP_WPFP500         500
**     WPFP_WPFP501         501
**     WPFP_WPFP502         502
**     WPFP_WPFP503         503
**     WPFP_WPFP504         504
**     WPFP_WPFP505         505
**     WPFP_WPFP506         506
**     WPFP_WPFP507         507
**     WPFP_WPFP508         508
**     WPFP_WPFP509         509
**     WPFP_WPFP510         510
**     WPFP_WPFP511         511
**
*/

