mentatpsi/Microchip/PIC24F Starter Kit 1/p24FJ256GB106.h
#define WPEND_WPSTARTMEM     0x7FFF
#define WPEND_WPENDMEM       0xFFFF

#define WPCFG_WPCFGEN        0xBFFF
#define WPCFG_WPCFGDIS       0xFFFF

#define WPDIS_WPEN           0xDFFF
#define WPDIS_WPDIS          0xFFFF

#define WPFP_WPFP0           0xFE00
#define WPFP_WPFP1           0xFE01
#define WPFP_WPFP2           0xFE02
#define WPFP_WPFP3           0xFE03
#define WPFP_WPFP4           0xFE04
#define WPFP_WPFP5           0xFE05
#define WPFP_WPFP6           0xFE06
#define WPFP_WPFP7           0xFE07
#define WPFP_WPFP8           0xFE08
#define WPFP_WPFP9           0xFE09
#define WPFP_WPFP10          0xFE0A
#define WPFP_WPFP11          0xFE0B
#define WPFP_WPFP12          0xFE0C
#define WPFP_WPFP13          0xFE0D
#define WPFP_WPFP14          0xFE0E
#define WPFP_WPFP15          0xFE0F
#define WPFP_WPFP16          0xFE10
#define WPFP_WPFP17          0xFE11
#define WPFP_WPFP18          0xFE12
#define WPFP_WPFP19          0xFE13
#define WPFP_WPFP20          0xFE14
#define WPFP_WPFP21          0xFE15
#define WPFP_WPFP22          0xFE16
#define WPFP_WPFP23          0xFE17
#define WPFP_WPFP24          0xFE18
#define WPFP_WPFP25          0xFE19
#define WPFP_WPFP26          0xFE1A
#define WPFP_WPFP27          0xFE1B
#define WPFP_WPFP28          0xFE1C
#define WPFP_WPFP29          0xFE1D
#define WPFP_WPFP30          0xFE1E
#define WPFP_WPFP31          0xFE1F
#define WPFP_WPFP32          0xFE20
#define WPFP_WPFP33          0xFE21
#define WPFP_WPFP34          0xFE22
#define WPFP_WPFP35          0xFE23
#define WPFP_WPFP36          0xFE24
#define WPFP_WPFP37          0xFE25
#define WPFP_WPFP38          0xFE26
#define WPFP_WPFP39          0xFE27
#define WPFP_WPFP40          0xFE28
#define WPFP_WPFP41          0xFE29
#define WPFP_WPFP42          0xFE2A
#define WPFP_WPFP43          0xFE2B
#define WPFP_WPFP44          0xFE2C
#define WPFP_WPFP45          0xFE2D
#define WPFP_WPFP46          0xFE2E
#define WPFP_WPFP47          0xFE2F
#define WPFP_WPFP48          0xFE30
#define WPFP_WPFP49          0xFE31
#define WPFP_WPFP50          0xFE32
#define WPFP_WPFP51          0xFE33
#define WPFP_WPFP52          0xFE34
#define WPFP_WPFP53          0xFE35
#define WPFP_WPFP54          0xFE36
#define WPFP_WPFP55          0xFE37
#define WPFP_WPFP56          0xFE38
#define WPFP_WPFP57          0xFE39
#define WPFP_WPFP58          0xFE3A
#define WPFP_WPFP59          0xFE3B
#define WPFP_WPFP60          0xFE3C
#define WPFP_WPFP61          0xFE3D
#define WPFP_WPFP62          0xFE3E
#define WPFP_WPFP63          0xFE3F
#define WPFP_WPFP64          0xFE40
#define WPFP_WPFP65          0xFE41
#define WPFP_WPFP66          0xFE42
#define WPFP_WPFP67          0xFE43
#define WPFP_WPFP68          0xFE44
#define WPFP_WPFP69          0xFE45
#define WPFP_WPFP70          0xFE46
#define WPFP_WPFP71          0xFE47
#define WPFP_WPFP72          0xFE48
#define WPFP_WPFP73          0xFE49
#define WPFP_WPFP74          0xFE4A
#define WPFP_WPFP75          0xFE4B
#define WPFP_WPFP76          0xFE4C
#define WPFP_WPFP77          0xFE4D
#define WPFP_WPFP78          0xFE4E
#define WPFP_WPFP79          0xFE4F
#define WPFP_WPFP80          0xFE50
#define WPFP_WPFP81          0xFE51
#define WPFP_WPFP82          0xFE52
#define WPFP_WPFP83          0xFE53
#define WPFP_WPFP84          0xFE54
#define WPFP_WPFP85          0xFE55
#define WPFP_WPFP86          0xFE56
#define WPFP_WPFP87          0xFE57
#define WPFP_WPFP88          0xFE58
#define WPFP_WPFP89          0xFE59
#define WPFP_WPFP90          0xFE5A
#define WPFP_WPFP91          0xFE5B
#define WPFP_WPFP92          0xFE5C
#define WPFP_WPFP93          0xFE5D
#define WPFP_WPFP94          0xFE5E
#define WPFP_WPFP95          0xFE5F
#define WPFP_WPFP96          0xFE60
#define WPFP_WPFP97          0xFE61
#define WPFP_WPFP98          0xFE62
#define WPFP_WPFP99          0xFE63
#define WPFP_WPFP100         0xFE64
#define WPFP_WPFP101         0xFE65
#define WPFP_WPFP102         0xFE66
#define WPFP_WPFP103         0xFE67
#define WPFP_WPFP104         0xFE68
#define WPFP_WPFP105         0xFE69
#define WPFP_WPFP106         0xFE6A
#define WPFP_WPFP107         0xFE6B
#define WPFP_WPFP108         0xFE6C
#define WPFP_WPFP109         0xFE6D
#define WPFP_WPFP110         0xFE6E
#define WPFP_WPFP111         0xFE6F
#define WPFP_WPFP112         0xFE70
#define WPFP_WPFP113         0xFE71
#define WPFP_WPFP114         0xFE72
#define WPFP_WPFP115         0xFE73
#define WPFP_WPFP116         0xFE74
#define WPFP_WPFP117         0xFE75
#define WPFP_WPFP118         0xFE76
#define WPFP_WPFP119         0xFE77
#define WPFP_WPFP120         0xFE78
#define WPFP_WPFP121         0xFE79
#define WPFP_WPFP122         0xFE7A
#define WPFP_WPFP123         0xFE7B
#define WPFP_WPFP124         0xFE7C
#define WPFP_WPFP125         0xFE7D
#define WPFP_WPFP126         0xFE7E
#define WPFP_WPFP127         0xFE7F
#define WPFP_WPFP128         0xFE80
#define WPFP_WPFP129         0xFE81
#define WPFP_WPFP130         0xFE82
#define WPFP_WPFP131         0xFE83
#define WPFP_WPFP132         0xFE84
#define WPFP_WPFP133         0xFE85
#define WPFP_WPFP134         0xFE86
#define WPFP_WPFP135         0xFE87
#define WPFP_WPFP136         0xFE88
#define WPFP_WPFP137         0xFE89
#define WPFP_WPFP138         0xFE8A
#define WPFP_WPFP139         0xFE8B
#define WPFP_WPFP140         0xFE8C
#define WPFP_WPFP141         0xFE8D
#define WPFP_WPFP142         0xFE8E
#define WPFP_WPFP143         0xFE8F
#define WPFP_WPFP144         0xFE90
#define WPFP_WPFP145         0xFE91
#define WPFP_WPFP146         0xFE92
#define WPFP_WPFP147         0xFE93
#define WPFP_WPFP148         0xFE94
#define WPFP_WPFP149         0xFE95
#define WPFP_WPFP150         0xFE96
#define WPFP_WPFP151         0xFE97
#define WPFP_WPFP152         0xFE98
#define WPFP_WPFP153         0xFE99
#define WPFP_WPFP154         0xFE9A
#define WPFP_WPFP155         0xFE9B
#define WPFP_WPFP156         0xFE9C
#define WPFP_WPFP157         0xFE9D
#define WPFP_WPFP158         0xFE9E
#define WPFP_WPFP159         0xFE9F
#define WPFP_WPFP160         0xFEA0
#define WPFP_WPFP161         0xFEA1
#define WPFP_WPFP162         0xFEA2
#define WPFP_WPFP163         0xFEA3
#define WPFP_WPFP164         0xFEA4
#define WPFP_WPFP165         0xFEA5
#define WPFP_WPFP166         0xFEA6
#define WPFP_WPFP167         0xFEA7
#define WPFP_WPFP168         0xFEA8
#define WPFP_WPFP169         0xFEA9
#define WPFP_WPFP170         0xFEAA
#define WPFP_WPFP171         0xFEAB
#define WPFP_WPFP172         0xFEAC
#define WPFP_WPFP173         0xFEAD
#define WPFP_WPFP174         0xFEAE
#define WPFP_WPFP175         0xFEAF
#define WPFP_WPFP176         0xFEB0
#define WPFP_WPFP177         0xFEB1
#define WPFP_WPFP178         0xFEB2
#define WPFP_WPFP179         0xFEB3
#define WPFP_WPFP180         0xFEB4
#define WPFP_WPFP181         0xFEB5
#define WPFP_WPFP182         0xFEB6
#define WPFP_WPFP183         0xFEB7
#define WPFP_WPFP184         0xFEB8
#define WPFP_WPFP185         0xFEB9
#define WPFP_WPFP186         0xFEBA
#define WPFP_WPFP187         0xFEBB
#define WPFP_WPFP188         0xFEBC
#define WPFP_WPFP189         0xFEBD
#define WPFP_WPFP190         0xFEBE
#define WPFP_WPFP191         0xFEBF
#define WPFP_WPFP192         0xFEC0
#define WPFP_WPFP193         0xFEC1
#define WPFP_WPFP194         0xFEC2
#define WPFP_WPFP195         0xFEC3
#define WPFP_WPFP196         0xFEC4
#define WPFP_WPFP197         0xFEC5
#define WPFP_WPFP198         0xFEC6
#define WPFP_WPFP199         0xFEC7
#define WPFP_WPFP200         0xFEC8
#define WPFP_WPFP201         0xFEC9
#define WPFP_WPFP202         0xFECA
#define WPFP_WPFP203         0xFECB
#define WPFP_WPFP204         0xFECC
#define WPFP_WPFP205         0xFECD
#define WPFP_WPFP206         0xFECE
#define WPFP_WPFP207         0xFECF
#define WPFP_WPFP208         0xFED0
#define WPFP_WPFP209         0xFED1
#define WPFP_WPFP210         0xFED2
#define WPFP_WPFP211         0xFED3
#define WPFP_WPFP212         0xFED4
#define WPFP_WPFP213         0xFED5
#define WPFP_WPFP214         0xFED6
#define WPFP_WPFP215         0xFED7
#define WPFP_WPFP216         0xFED8
#define WPFP_WPFP217         0xFED9
#define WPFP_WPFP218         0xFEDA
#define WPFP_WPFP219         0xFEDB
#define WPFP_WPFP220         0xFEDC
#define WPFP_WPFP221         0xFEDD
#define WPFP_WPFP222         0xFEDE
#define WPFP_WPFP223         0xFEDF
#define WPFP_WPFP224         0xFEE0
#define WPFP_WPFP225         0xFEE1
#define WPFP_WPFP226         0xFEE2
#define WPFP_WPFP227         0xFEE3
#define WPFP_WPFP228         0xFEE4
#define WPFP_WPFP229         0xFEE5
#define WPFP_WPFP230         0xFEE6
#define WPFP_WPFP231         0xFEE7
#define WPFP_WPFP232         0xFEE8
#define WPFP_WPFP233         0xFEE9
#define WPFP_WPFP234         0xFEEA
#define WPFP_WPFP235         0xFEEB
#define WPFP_WPFP236         0xFEEC
#define WPFP_WPFP237         0xFEED
#define WPFP_WPFP238         0xFEEE
#define WPFP_WPFP239         0xFEEF
#define WPFP_WPFP240         0xFEF0
#define WPFP_WPFP241         0xFEF1
#define WPFP_WPFP242         0xFEF2
#define WPFP_WPFP243         0xFEF3
#define WPFP_WPFP244         0xFEF4
#define WPFP_WPFP245         0xFEF5
#define WPFP_WPFP246         0xFEF6
#define WPFP_WPFP247         0xFEF7
#define WPFP_WPFP248         0xFEF8
#define WPFP_WPFP249         0xFEF9
#define WPFP_WPFP250         0xFEFA
#define WPFP_WPFP251         0xFEFB
#define WPFP_WPFP252         0xFEFC
#define WPFP_WPFP253         0xFEFD
#define WPFP_WPFP254         0xFEFE
#define WPFP_WPFP255         0xFEFF
#define WPFP_WPFP256         0xFF00
#define WPFP_WPFP257         0xFF01
#define WPFP_WPFP258         0xFF02
#define WPFP_WPFP259         0xFF03
#define WPFP_WPFP260         0xFF04
#define WPFP_WPFP261         0xFF05
#define WPFP_WPFP262         0xFF06
#define WPFP_WPFP263         0xFF07
#define WPFP_WPFP264         0xFF08
#define WPFP_WPFP265         0xFF09
#define WPFP_WPFP266         0xFF0A
#define WPFP_WPFP267         0xFF0B
#define WPFP_WPFP268         0xFF0C
#define WPFP_WPFP269         0xFF0D
#define WPFP_WPFP270         0xFF0E
#define WPFP_WPFP271         0xFF0F
#define WPFP_WPFP272         0xFF10
#define WPFP_WPFP273         0xFF11
#define WPFP_WPFP274         0xFF12
#define WPFP_WPFP275         0xFF13
#define WPFP_WPFP276         0xFF14
#define WPFP_WPFP277         0xFF15
#define WPFP_WPFP278         0xFF16
#define WPFP_WPFP279         0xFF17
#define WPFP_WPFP280         0xFF18
#define WPFP_WPFP281         0xFF19
#define WPFP_WPFP282         0xFF1A
#define WPFP_WPFP283         0xFF1B
#define WPFP_WPFP284         0xFF1C
#define WPFP_WPFP285         0xFF1D
#define WPFP_WPFP286         0xFF1E
#define WPFP_WPFP287         0xFF1F
#define WPFP_WPFP288         0xFF20
#define WPFP_WPFP289         0xFF21
#define WPFP_WPFP290         0xFF22
#define WPFP_WPFP291         0xFF23
#define WPFP_WPFP292         0xFF24
#define WPFP_WPFP293         0xFF25
#define WPFP_WPFP294         0xFF26
#define WPFP_WPFP295         0xFF27
#define WPFP_WPFP296         0xFF28
#define WPFP_WPFP297         0xFF29
#define WPFP_WPFP298         0xFF2A
#define WPFP_WPFP299         0xFF2B
#define WPFP_WPFP300         0xFF2C
#define WPFP_WPFP301         0xFF2D
#define WPFP_WPFP302         0xFF2E
#define WPFP_WPFP303         0xFF2F
#define WPFP_WPFP304         0xFF30
#define WPFP_WPFP305         0xFF31
#define WPFP_WPFP306         0xFF32
#define WPFP_WPFP307         0xFF33
#define WPFP_WPFP308         0xFF34
#define WPFP_WPFP309         0xFF35
#define WPFP_WPFP310         0xFF36
#define WPFP_WPFP311         0xFF37
#define WPFP_WPFP312         0xFF38
#define WPFP_WPFP313         0xFF39
#define WPFP_WPFP314         0xFF3A
#define WPFP_WPFP315         0xFF3B
#define WPFP_WPFP316         0xFF3C
#define WPFP_WPFP317         0xFF3D
#define WPFP_WPFP318         0xFF3E
#define WPFP_WPFP319         0xFF3F
#define WPFP_WPFP320         0xFF40
#define WPFP_WPFP321         0xFF41
#define WPFP_WPFP322         0xFF42
#define WPFP_WPFP323         0xFF43
#define WPFP_WPFP324         0xFF44
#define WPFP_WPFP325         0xFF45
#define WPFP_WPFP326         0xFF46
#define WPFP_WPFP327         0xFF47
#define WPFP_WPFP328         0xFF48
#define WPFP_WPFP329         0xFF49
#define WPFP_WPFP330         0xFF4A
#define WPFP_WPFP331         0xFF4B
#define WPFP_WPFP332         0xFF4C
#define WPFP_WPFP333         0xFF4D
#define WPFP_WPFP334         0xFF4E
#define WPFP_WPFP335         0xFF4F
#define WPFP_WPFP336         0xFF50
#define WPFP_WPFP337         0xFF51
#define WPFP_WPFP338         0xFF52
#define WPFP_WPFP339         0xFF53
#define WPFP_WPFP340         0xFF54
#define WPFP_WPFP341         0xFF55
#define WPFP_WPFP342         0xFF56
#define WPFP_WPFP343         0xFF57
#define WPFP_WPFP344         0xFF58
#define WPFP_WPFP345         0xFF59
#define WPFP_WPFP346         0xFF5A
#define WPFP_WPFP347         0xFF5B
#define WPFP_WPFP348         0xFF5C
#define WPFP_WPFP349         0xFF5D
#define WPFP_WPFP350         0xFF5E
#define WPFP_WPFP351         0xFF5F
#define WPFP_WPFP352         0xFF60
#define WPFP_WPFP353         0xFF61
#define WPFP_WPFP354         0xFF62
#define WPFP_WPFP355         0xFF63
#define WPFP_WPFP356         0xFF64
#define WPFP_WPFP357         0xFF65
#define WPFP_WPFP358         0xFF66
#define WPFP_WPFP359         0xFF67
#define WPFP_WPFP360         0xFF68
#define WPFP_WPFP361         0xFF69
#define WPFP_WPFP362         0xFF6A
#define WPFP_WPFP363         0xFF6B
#define WPFP_WPFP364         0xFF6C
#define WPFP_WPFP365         0xFF6D
#define WPFP_WPFP366         0xFF6E
#define WPFP_WPFP367         0xFF6F
#define WPFP_WPFP368         0xFF70
#define WPFP_WPFP369         0xFF71
#define WPFP_WPFP370         0xFF72
#define WPFP_WPFP371         0xFF73
#define WPFP_WPFP372         0xFF74
#define WPFP_WPFP373         0xFF75
#define WPFP_WPFP374         0xFF76
#define WPFP_WPFP375         0xFF77
#define WPFP_WPFP376         0xFF78
#define WPFP_WPFP377         0xFF79
#define WPFP_WPFP378         0xFF7A
#define WPFP_WPFP379         0xFF7B
#define WPFP_WPFP380         0xFF7C
#define WPFP_WPFP381         0xFF7D
#define WPFP_WPFP382         0xFF7E
#define WPFP_WPFP383         0xFF7F
#define WPFP_WPFP384         0xFF80
#define WPFP_WPFP385         0xFF81
#define WPFP_WPFP386         0xFF82
#define WPFP_WPFP387         0xFF83
#define WPFP_WPFP388         0xFF84
#define WPFP_WPFP389         0xFF85
#define WPFP_WPFP390         0xFF86
#define WPFP_WPFP391         0xFF87
#define WPFP_WPFP392         0xFF88
#define WPFP_WPFP393         0xFF89
#define WPFP_WPFP394         0xFF8A
#define WPFP_WPFP395         0xFF8B
#define WPFP_WPFP396         0xFF8C
#define WPFP_WPFP397         0xFF8D
#define WPFP_WPFP398         0xFF8E
#define WPFP_WPFP399         0xFF8F
#define WPFP_WPFP400         0xFF90
#define WPFP_WPFP401         0xFF91
#define WPFP_WPFP402         0xFF92
#define WPFP_WPFP403         0xFF93
#define WPFP_WPFP404         0xFF94
#define WPFP_WPFP405         0xFF95
#define WPFP_WPFP406         0xFF96
#define WPFP_WPFP407         0xFF97
#define WPFP_WPFP408         0xFF98
#define WPFP_WPFP409         0xFF99
#define WPFP_WPFP410         0xFF9A
#define WPFP_WPFP411         0xFF9B
#define WPFP_WPFP412         0xFF9C
#define WPFP_WPFP413         0xFF9D
#define WPFP_WPFP414         0xFF9E
#define WPFP_WPFP415         0xFF9F
#define WPFP_WPFP416         0xFFA0
#define WPFP_WPFP417         0xFFA1
#define WPFP_WPFP418         0xFFA2
#define WPFP_WPFP419         0xFFA3
#define WPFP_WPFP420         0xFFA4
#define WPFP_WPFP421         0xFFA5
#define WPFP_WPFP422         0xFFA6
#define WPFP_WPFP423         0xFFA7
#define WPFP_WPFP424         0xFFA8
#define WPFP_WPFP425         0xFFA9
#define WPFP_WPFP426         0xFFAA
#define WPFP_WPFP427         0xFFAB
#define WPFP_WPFP428         0xFFAC
#define WPFP_WPFP429         0xFFAD
#define WPFP_WPFP430         0xFFAE
#define WPFP_WPFP431         0xFFAF
#define WPFP_WPFP432         0xFFB0
#define WPFP_WPFP433         0xFFB1
#define WPFP_WPFP434         0xFFB2
#define WPFP_WPFP435         0xFFB3
#define WPFP_WPFP436         0xFFB4
#define WPFP_WPFP437         0xFFB5
#define WPFP_WPFP438         0xFFB6
#define WPFP_WPFP439         0xFFB7
#define WPFP_WPFP440         0xFFB8
#define WPFP_WPFP441         0xFFB9
#define WPFP_WPFP442         0xFFBA
#define WPFP_WPFP443         0xFFBB
#define WPFP_WPFP444         0xFFBC
#define WPFP_WPFP445         0xFFBD
#define WPFP_WPFP446         0xFFBE
#define WPFP_WPFP447         0xFFBF
#define WPFP_WPFP448         0xFFC0
#define WPFP_WPFP449         0xFFC1
#define WPFP_WPFP450         0xFFC2
#define WPFP_WPFP451         0xFFC3
#define WPFP_WPFP452         0xFFC4
#define WPFP_WPFP453         0xFFC5
#define WPFP_WPFP454         0xFFC6
#define WPFP_WPFP455         0xFFC7
#define WPFP_WPFP456         0xFFC8
#define WPFP_WPFP457         0xFFC9
#define WPFP_WPFP458         0xFFCA
#define WPFP_WPFP459         0xFFCB
#define WPFP_WPFP460         0xFFCC
#define WPFP_WPFP461         0xFFCD
#define WPFP_WPFP462         0xFFCE
#define WPFP_WPFP463         0xFFCF
#define WPFP_WPFP464         0xFFD0
#define WPFP_WPFP465         0xFFD1
#define WPFP_WPFP466         0xFFD2
#define WPFP_WPFP467         0xFFD3
#define WPFP_WPFP468         0xFFD4
#define WPFP_WPFP469         0xFFD5
#define WPFP_WPFP470         0xFFD6
#define WPFP_WPFP471         0xFFD7
#define WPFP_WPFP472         0xFFD8
#define WPFP_WPFP473         0xFFD9
#define WPFP_WPFP474         0xFFDA
#define WPFP_WPFP475         0xFFDB
#define WPFP_WPFP476         0xFFDC
#define WPFP_WPFP477         0xFFDD
#define WPFP_WPFP478         0xFFDE
#define WPFP_WPFP479         0xFFDF
#define WPFP_WPFP480         0xFFE0
#define WPFP_WPFP481         0xFFE1
#define WPFP_WPFP482         0xFFE2
#define WPFP_WPFP483         0xFFE3
#define WPFP_WPFP484         0xFFE4
#define WPFP_WPFP485         0xFFE5
#define WPFP_WPFP486         0xFFE6
#define WPFP_WPFP487         0xFFE7
#define WPFP_WPFP488         0xFFE8
#define WPFP_WPFP489         0xFFE9
#define WPFP_WPFP490         0xFFEA
#define WPFP_WPFP491         0xFFEB
#define WPFP_WPFP492         0xFFEC
#define WPFP_WPFP493         0xFFED
#define WPFP_WPFP494         0xFFEE
#define WPFP_WPFP495         0xFFEF
#define WPFP_WPFP496         0xFFF0
#define WPFP_WPFP497         0xFFF1
#define WPFP_WPFP498         0xFFF2
#define WPFP_WPFP499         0xFFF3
#define WPFP_WPFP500         0xFFF4
#define WPFP_WPFP501         0xFFF5
#define WPFP_WPFP502         0xFFF6
#define WPFP_WPFP503         0xFFF7
#define WPFP_WPFP504         0xFFF8
#define WPFP_WPFP505         0xFFF9
#define WPFP_WPFP506         0xFFFA
#define WPFP_WPFP507         0xFFFB
#define WPFP_WPFP508         0xFFFC
#define WPFP_WPFP509         0xFFFD
#define WPFP_WPFP510         0xFFFE
#define WPFP_WPFP511         0xFFFF

/* Register CONFIG2 (0x2abfc)                               */

#define _CONFIG2(x) __attribute__((section("__CONFIG2.sec,code"))) int _CONFIG2 = (x);

